.. _nace_userguide:

NACE Strings
============

Introduction
------------

The function :func:`clean_eu_nace() <dataprep.clean.clean_eu_nace.clean_eu_nace>` cleans a column containing Classification for businesses in the European Union (NACE) strings, and standardizes them in a given format. The function :func:`validate_eu_nace() <dataprep.clean.clean_eu_nace.validate_eu_nace>` validates either a single NACE strings, a column of NACE strings or a DataFrame of NACE strings, returning `True` if the value is valid, and `False` otherwise.

NACE strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "6201"
* `standard`: NACE strings with proper whitespace in the proper places, like "62.01"
* `label`: return the category label for the number, like "Computer programming activities".

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_eu_nace()` and `validate_eu_nace()`.

### An example dataset containing NACE strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "nace": [
            "6201",
            "99999999999",
            "999 999 999",
            "004085616",
            "002 724 334",
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

          nace                                           address
0         6201                                     123 Pine Ave.
1  99999999999                                           main st
2  999 999 999                      1234 west main heights 57033
3    004085616                    apt 1 789 s maple rd manhattan
4  002 724 334                robie house, 789 north main street
5        hello         1111 S Figueroa St, Los Angeles, CA 90015
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles
7         NULL                                             hello

## 1. Default `clean_eu_nace`

By default, `clean_eu_nace` will clean nace strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_eu_nace
clean_eu_nace(df, column = "nace")

          nace                                           address nace_clean
0         6201                                     123 Pine Ave.      62.01
1  99999999999                                           main st        NaN
2  999 999 999                      1234 west main heights 57033        NaN
3    004085616                    apt 1 789 s maple rd manhattan        NaN
4  002 724 334                robie house, 789 north main street        NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015        NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles        NaN
7         NULL                                             hello        NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_eu_nace(df, column = "nace", output_format="standard")

          nace                                           address nace_clean
0         6201                                     123 Pine Ave.      62.01
1  99999999999                                           main st        NaN
2  999 999 999                      1234 west main heights 57033        NaN
3    004085616                    apt 1 789 s maple rd manhattan        NaN
4  002 724 334                robie house, 789 north main street        NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015        NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles        NaN
7         NULL                                             hello        NaN

### `compact`

In [4]:
clean_eu_nace(df, column = "nace", output_format="compact")

          nace                                           address nace_clean
0         6201                                     123 Pine Ave.       6201
1  99999999999                                           main st        NaN
2  999 999 999                      1234 west main heights 57033        NaN
3    004085616                    apt 1 789 s maple rd manhattan        NaN
4  002 724 334                robie house, 789 north main street        NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015        NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles        NaN
7         NULL                                             hello        NaN

### `label`

In [5]:
clean_eu_nace(df, column = "nace", output_format="label")

,nace,address,nace_clean
0,6201,123 Pine Ave.,Computer programming activities
1,99999999999,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned NACE strings is added with a title in the format `"{original title}_clean"`.

In [6]:
clean_eu_nace(df, column="nace", inplace=True)

  nace_clean                                           address
0      62.01                                     123 Pine Ave.
1        NaN                                           main st
2        NaN                      1234 west main heights 57033
3        NaN                    apt 1 789 s maple rd manhattan
4        NaN                robie house, 789 north main street
5        NaN         1111 S Figueroa St, Los Angeles, CA 90015
6        NaN  (staples center) 1111 S Figueroa St, Los Angeles
7        NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [7]:
clean_eu_nace(df, "nace", errors="coerce")

          nace                                           address nace_clean
0         6201                                     123 Pine Ave.      62.01
1  99999999999                                           main st        NaN
2  999 999 999                      1234 west main heights 57033        NaN
3    004085616                    apt 1 789 s maple rd manhattan        NaN
4  002 724 334                robie house, 789 north main street        NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015        NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles        NaN
7         NULL                                             hello        NaN

### `ignore`

In [8]:
clean_eu_nace(df, "nace", errors="ignore")

          nace                                           address   nace_clean
0         6201                                     123 Pine Ave.        62.01
1  99999999999                                           main st  99999999999
2  999 999 999                      1234 west main heights 57033  999 999 999
3    004085616                    apt 1 789 s maple rd manhattan    004085616
4  002 724 334                robie house, 789 north main street  002 724 334
5        hello         1111 S Figueroa St, Los Angeles, CA 90015        hello
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

## 4. `validate_eu_nace()`

`validate_eu_nace()` returns `True` when the input is a valid NACE. Otherwise it returns `False`.

The input of `validate_eu_nace()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_eu_nace()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_eu_nace()` returns the validation result for the whole DataFrame.

In [9]:
from dataprep.clean import validate_eu_nace
print(validate_eu_nace("6201"))
print(validate_eu_nace("99999999999"))
print(validate_eu_nace("999 999 999"))
print(validate_eu_nace("51824753556"))
print(validate_eu_nace("004085616"))
print(validate_eu_nace("hello"))
print(validate_eu_nace(np.nan))
print(validate_eu_nace("NULL"))

True
False
False
False
False
False
False
False

### Series

In [10]:
validate_eu_nace(df["nace"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: nace, dtype: bool

### DataFrame + Specify Column

In [11]:
validate_eu_nace(df, column="nace")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: nace, dtype: bool

### Only DataFrame

In [12]:
validate_eu_nace(df)

    nace  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False
7  False    False